Ran Plan for dir: `environments/devops/ec2` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform plan -input=false -refresh -out \"/atlantis-data/repos/sarhipov/atlantis/14/default/environments/devops/ec2/default.tfplan\"" in "/atlantis-data/repos/sarhipov/atlantis/14/default/environments/devops/ec2": exit status 1
data.terraform_remote_state.network: Reading...
data.terraform_remote_state.network: Read complete after 0s
data.aws_ami.arm: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_key_pair.my-key will be created
  + resource "aws_key_pair" "my-key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "sergei-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC8GGK02oHTf3L/0Fc93mlTW34Q2NUZeywzD194r2RCXpQMQljT1E0BaZ/TRlSzCCGf46JBjmYhKPDGtoN78vHJ1HYZ7eTMSfdIk1XOVVRtBKOgxnHGP6APXGI6WFA23LsgaL/MmlDfR2Vari+c8CV9vODVhInM7OHGj/8DX0bfWwv7neytbulccqXxvEJ7/ljIQnCDIxzj/w6EUjAZifJz32/DRXDnHZ0U2+PwD8C3Ni1seFejA2X3hrPZsKSdUweW7cDwapsqSL2BoDdlrgnGCBC0WQCVKCLDW5dMDqDmjLgJfTpsQBoJj2VtRq/B3mYGwCc7itCeVksZHNQabd1PbYZw2iwaatMsmZL+qKa2vg5uPIF5bymDuD+4TnXtEvcPtkmgGilMDACE152P5kF1E4mG5xdvNL+lFpLMDYwJjEzIUcXb1Z+ddyyueRtAcUspmxU0HCAWlucWj9WE+yx1Vdbxkelxo7W52KP+BHvoL3h/FwTNNZwxyFmR3WV88dk= sergeiarhipov@ip-192-168-1-146.us-west-2.compute.internal"
      + tags_all        = {
          + "Environment"     = "devops-tools"
          + "Terraform"       = "Managed"
          + "Terraform-state" = "ec2"
        }
    }

  # module.test-ec2-security-groups.aws_security_group.security-group["test-ec2"] will be created
  + resource "aws_security_group" "security-group" {
      + arn                    = (known after apply)
      + description            = "Security group for test-ec2"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "test-ec2"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"            = "test-ec2"
          + "Terraform-state" = "network/module.main-vpc-security-groups"
        }
      + tags_all               = {
          + "Environment"     = "devops-tools"
          + "Name"            = "test-ec2"
          + "Terraform"       = "Managed"
          + "Terraform-state" = "network/module.main-vpc-security-groups"
        }
      + vpc_id                 = "vpc-0cef64a57139e2051"
    }

  # module.test-ec2-security-groups.aws_vpc_security_group_egress_rule.egress_rules["test-ec2.egress.allow_all_outbound"] will be created
  + resource "aws_vpc_security_group_egress_rule" "egress_rules" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment"     = "devops-tools"
          + "Terraform"       = "Managed"
          + "Terraform-state" = "ec2"
        }
      + to_port                = -1
    }

  # module.test-ec2-security-groups.aws_vpc_security_group_ingress_rule.ingress_rules["test-ec2.ingress.allow_all_inbound"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "ingress_rules" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all inbound"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment"     = "devops-tools"
          + "Terraform"       = "Managed"
          + "Terraform-state" = "ec2"
        }
      + to_port                = -1
    }

Plan: 4 to add, 0 to change, 0 to destroy.
╷
│ Error: reading EC2 AMIs: operation error EC2: DescribeImages, https response error StatusCode: 403, RequestID: 933b4e5c-bdd4-457c-8618-ce96cb83c06e, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::806176696849:assumed-role/arm-workers-eks-node-group/i-0bfeb9cf1891cdeb1 is not authorized to perform: ec2:DescribeImages because no identity-based policy allows the ec2:DescribeImages action
│ 
│   with data.aws_ami.arm,
│   on data.tf line 10, in data "aws_ami" "arm":
│   10: data "aws_ami" "arm" {
│ 
╵


```
</details>